YZ-Qiu/Scope_STM32/Src/ui/gui.c
	wi.g.show = TRUE;
	wi.g.x = 65;
	wi.g.y = 200;
	wi.g.width = 70;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text ="";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_RMS_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_RMS_Label_Txt, FALSE);
	gwinSetFont(CH1_RMS_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_RMS_Label_Txt);

/*
	// Create label widget: CH1_SF_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 60;
	wi.g.y = 210;
	wi.g.width = 50;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_SF_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_SF_Label_Txt, FALSE);
	gwinSetFont(CH1_SF_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_SF_Label_Txt);
*/

	// Create label widget: CH1_Max_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 165;
	wi.g.y = 200;
	wi.g.width = 60;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Max_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Max_Label_Txt, FALSE);
	gwinSetFont(CH1_Max_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_Max_Label_Txt);

	// Create label widget: CH1_Min_Label_Txt

	wi.g.show = TRUE;
	wi.g.x = 165;
	wi.g.y = 210;
	wi.g.width = 60;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Min_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Min_Label_Txt, FALSE);
	gwinSetFont(CH1_Min_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_Min_Label_Txt);

	// Create label widget: CH1_PP_Label_Txt

	wi.g.show = TRUE;
	wi.g.x = 245;
	wi.g.y = 200;
	wi.g.width = 75;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_PP_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_PP_Label_Txt, FALSE);
	gwinSetFont(CH1_PP_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_PP_Label_Txt);

	// Create label widget: CH1_Pk_Label_Txt

	wi.g.show = TRUE;
	wi.g.x = 245;
	wi.g.y = 210;
	wi.g.width = 75;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Pk_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Pk_Label_Txt, FALSE);
	gwinSetFont(CH1_Pk_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_Pk_Label_Txt);

/*
	// Create label widget: CH1_RT_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 265;
	wi.g.y = 200;
	wi.g.width = 55;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_RT_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_RT_Label_Txt, FALSE);
	gwinSetFont(CH1_RT_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_RT_Label_Txt);
*/

	// Create label widget: CH1_P_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 50;
	wi.g.y = 210;
	wi.g.width = 85;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_P_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_P_Label_Txt, FALSE);
	gwinSetFont(CH1_P_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_P_Label_Txt);

	// Create list widget: T_Div_List
	wi.g.show = FALSE;
	wi.g.x = 30;
	wi.g.y = 30;
	wi.g.width = 50;
	wi.g.height = 70;
	wi.g.parent = ghContainerPage0;
	wi.text = "List1";
	wi.customDraw = gwinListDefaultDraw;
	wi.customParam = 0;
	wi.customStyle = &divc;
	T_Div_List = gwinListCreate(0, &wi, FALSE);
	gwinSetTag(T_Div_List,T_Div_List_ID);
	gwinListSetScroll(T_Div_List, scrollSmooth);
	gwinSetFont(T_Div_List, dejavu_sans_12);
	gwinRedraw(T_Div_List);
    gwinListAddItem(T_Div_List, "10us", TRUE);
    gwinListAddItem(T_Div_List, "25us", TRUE);
    gwinListAddItem(T_Div_List, "50us", TRUE);
    gwinListAddItem(T_Div_List, "100us", TRUE);
    gwinListAddItem(T_Div_List, "500us", TRUE);
    gwinListAddItem(T_Div_List, "1ms", TRUE);
	gwinListSetSelected(T_Div_List, 0, FALSE);
	gwinListSetSelected(T_Div_List, 1, FALSE);
	gwinListSetSelected(T_Div_List, 2, FALSE);
	gwinListSetSelected(T_Div_List, 3, FALSE);
	gwinListSetSelected(T_Div_List, 4, FALSE);
	gwinListSetSelected(T_Div_List, 5, FALSE);




}


void guiShowPage(unsigned pageIndex)
{
	// Hide all pages
	gwinHide(ghContainerPage0);

	// Show page selected page
	switch (pageIndex) {
	case 0:
		gwinShow(ghContainerPage0);
		break;

	default:
		break;
	}
}
int use_buf=0;
void waveDisplay()
{
	/*
		int i;
 	for(i = 0; i < 320; i++) {
        gdispDrawPixel(i, 120+80*cos(2*M_PI*i/200),White);
    }
    */

  //uint16_t ADC_val=0;
  uint16_t smp_cnt = 0;

  uint16_t buf_i=0;
  //Assume 42MHz sample rate---> down scale to 420Hz
  char str[32];
  int i;
  while(!UI_data_ready)
  {

  	ADC_val = HAL_ADC_GetValue(&hadc1);
    smp_cnt++;
    if(smp_cnt > 10){
      if(buf_i==320)
      {
        use_buf = !use_buf;
        for(i=0;i<(320-1);i++)
        {
          gdispDrawLine( i,ADC_buffer[use_buf][i],i,ADC_buffer[use_buf][i+1],Black);
        }
        use_buf = !use_buf;
        
        for(i=0;i<(320-1);i++)
        {
          gdispDrawLine( i,ADC_buffer[use_buf][i],i,ADC_buffer[use_buf][i+1],Green);
        }
        use_buf = !use_buf;
        UI_data_ready = TRUE;
        updateMeasData();
       break;
       
      }
      //clipped to y = 31~199
      i=(ADC_val)*240/4096;
      if(i < 31)
      	ADC_buffer[use_buf][buf_i] = 31;
      else if(i > 199)
      	ADC_buffer[use_buf][buf_i] = 199;
      else
      	ADC_buffer[use_buf][buf_i] = i;


      buf_i++;
      smp_cnt = 0;
    }
  }
  
}

void updateMeasData()
{
	char updateValue[16];
	float2str(findMax(),updateValue,3);
	gwinSetText(CH1_Max_Label_Txt,updateValue,TRUE);	
	float2str(findRMS(),updateValue,3);
	gwinSetText(CH1_RMS_Label_Txt,updateValue,TRUE);
	float2str(findMin(),updateValue,3);
	gwinSetText(CH1_Min_Label_Txt,updateValue,TRUE);	
	float2str(findP2P(),updateValue,3);
	gwinSetText(CH1_PP_Label_Txt,updateValue,TRUE);
	float2str(findPk(),updateValue,3);
	gwinSetText(CH1_Pk_Label_Txt,updateValue,TRUE);	
	if(findPeriod()==0)
		gwinSetText(CH1_P_Label_Txt,"Nan",TRUE);
	else
	{
		float2str(findPeriod(),updateValue,3);
		gwinSetText(CH1_P_Label_Txt,updateValue,TRUE);
	}
	if(findTrigXA()==320)
		gwinSetText(X_A_Label_Txt,"Nan",TRUE);
	else
	{
		float2str(findTrigXA(),updateValue,0);
		gwinSetText(X_A_Label_Txt,updateValue,TRUE);
	}
	float2str(240-Trg_Y_val,updateValue,0);
	gwinSetText(Y_A_Label_Txt,updateValue,TRUE);	
	UI_data_ready = FALSE;
}

int findTrigXA()
{
	int i;
	for(i=0;i<320;i++)
	{
		if(ADC_buffer[0][i]==Trg_Y_val)
			goto END;
	}
	END:
	return i;
}

int findPeriod()
{
	int i,p1=0,p2=0,counter=0;
	for(i=0;i<319;i++)
	{
		if(ADC_buffer[0][i]==Trg_Y_val)
		{
			counter++;
			if(counter==1)
				p1=i;
			else if(counter==5)
				p2=i;
		}
	}
	return (p2-p1)/2;
}

float findMax()
{
	int i;
	float max=0;
	for(i=0;i<319;i++)
		max = ((max<ADC_buffer[0][i])?ADC_buffer[0][i]:max);
	return max;
}

