YZ-Qiu/Scope_STM32/Src/ui/gui.c
float findMin()
{
	int i;
	float min=4096;
	for(i=0;i<319;i++)
		min = ((min>ADC_buffer[0][i])?ADC_buffer[0][i]:min);
	return min;
}

float findP2P()
{
	return findMax()-findMin();
}

float findPk()
{
	return findP2P()/2;
}

float findRMS()
{
	int i;
	float RMS=0;
	for(i=0;i<319;i++)
		RMS += (ADC_buffer[0][i]*ADC_buffer[0][i]);
	RMS = sqrt(RMS/319);
	return RMS;
}

/*
float findRT()
{
	//after trigger solved
	//need to know if signal is increasing or not 
	//and increase from 10%-->90%
}
*/



void guiCreate(void)
{
	GWidgetInit wi;

	// Prepare fonts
	dejavu_sans_16 = gdispOpenFont("DejaVuSans16");
	dejavu_sans_12 = gdispOpenFont("DejaVuSans12");
	dejavu_sans_10 = gdispOpenFont("DejaVuSans10");

	// Prepare images

	// GWIN settings
	gwinWidgetClearInit(&wi);
	gwinSetDefaultFont(dejavu_sans_16);
	gwinSetDefaultStyle(&white, FALSE);
	gwinSetDefaultColor(black_studio);
	gwinSetDefaultBgColor(black_studio);

	// Create all the display pages
	createPagePage0();

	// Select the default display page


	guiShowPage(0);



	//draw ADC data

/*
   float val=0;
    char str[16];
     for(;;)
  {

    val+=0.001;
   // sprintf(str, "%.3f", val);
  //	snprintf(str, sizeof(str), "%.3f", val);

  float2str(ADC_val,str,3);

   LCD_print(10, 30, str);
    osDelay(300);
    LCD_printColor(10, 30, str, Black);
   // LCD_Clear(Black);
  }
*/
	


/*
	int i;
 	for(i = 0; i < 320; i++) {
        gdispDrawPixel(i, 120+80*cos(2*M_PI*i/200),White);
    }
*/
 
}

GHandle *opened_gh=NULL;

inline void btn_event(uint16_t tag)
{

	switch(tag)
	{
		case T_Div_Button_ID:
			if(gwinGetTag(*opened_gh) == V_Div_List_ID)
				gwinSetVisible( V_Div_List,FALSE);
			gwinSetVisible(T_Div_List, TRUE);
			opened_gh = &T_Div_List;
		break;
		case V_Div_Button_ID:
			if(gwinGetTag(*opened_gh) == T_Div_List_ID)
				gwinSetVisible( T_Div_List,FALSE);
			gwinSetVisible(V_Div_List, TRUE);
			opened_gh = &V_Div_List;
		break;	
		case Y_Trg_Button_ID:
			opened_gh = &Y_Trg_Button;
			drawDotLineHV(0, Trg_Y_val, 320, Trg_Y_val, Red);
		break;
	}
}
//Set text if select item
inline void lst_event(GHandle gh,uint16_t tag,GEvent* pe)
{
	switch(tag)
	{
		case T_Div_List_ID:
			gwinSetText(T_Div_Label,gwinListItemGetText(gh,((GEventGWinList *)pe)->item),TRUE);	
		break;
		case V_Div_List_ID:
			gwinSetText(V_Div_Label,gwinListItemGetText(gh,((GEventGWinList *)pe)->item),TRUE);		
		break;
			
	}
}


void guiEventLoop(void)
{
	//Setup code
	GEvent* pe;
	GHandle gh;
	GSourceHandle gs;	//for listen mouse event 
	GEventMouse     *pem;
	uint16_t tag;

	gs = ginputGetMouse(0);//for listen mouse event 
  	geventAttachSource(&glistener, gs, GLISTEN_MOUSEDOWNMOVES|GLISTEN_MOUSEMETA);
	//Inf 
	while (1) 
	{
		// Get an event
		//stuck here until event is received
   		waveDisplay();
 	
		pe = geventEventWait(&glistener,5);
		switch (pe->type) 
		{
			case GEVENT_GWIN_BUTTON:
				tag= gwinGetTag(((GEventGWinButton *)pe)->gwin);
				btn_event(tag);
			break;
			case GEVENT_GWIN_LIST:
				gh = ((GEventGWinList *)pe)->gwin;
				tag= gwinGetTag(gh);

				if(gwinListItemIsSelected(gh, ((GEventGWinList *)pe)->item))
				{
					lst_event(gh,tag,pe);
					gwinSetVisible(gh, FALSE);
				}
			break;
			default:
				if(opened_gh==NULL)
					break;
				tag = gwinGetTag(*opened_gh);
				
				switch(tag)
				{
					case Y_Trg_Button_ID:
						pem = (GEventMouse *)pe;
					 	if(pem->y >TOP_UI_Y && pem->y< DOWN_UI_Y)
					 	{
							//Clean previous draw
							drawDotLineHV(0, Trg_Y_val, 320, Trg_Y_val, Black);
							Trg_Y_val = pem->y;
							drawDotLineHV(0, Trg_Y_val, 320, Trg_Y_val, Red);
					 	}
					break;
					case V_Div_List_ID:
					case T_Div_List_ID:
						if(gwinListItemIsSelected(*opened_gh, ((GEventGWinList *)pe)->item))
						{
							lst_event(*opened_gh,tag,pe);
							gwinSetVisible(*opened_gh, FALSE);
							opened_gh = NULL;
						}
					break;
						
				}
			break;

		}

	}
}